#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```


Warning: Argument is deprecated

  with aws_eip.nat_gateway_eip,
  on infrastructure.tf line 52, in resource "aws_eip" "nat_gateway_eip":
  52:   vpc = true

use domain attribute instead
Success! The configuration is valid, but there were some validation warnings
as shown above.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
aws_ecs_cluster.ecs_cluster: Refreshing state... [id=arn:aws:ecs:ap-south-1:508656221602:cluster/ecs-runner-cluster]
aws_secretsmanager_secret.REPO: Refreshing state... [id=arn:aws:secretsmanager:ap-south-1:508656221602:secret:ecs-runner-REPO-Oe3Bht]
aws_ecr_repository.ECR_repository: Refreshing state... [id=ecs-runner]
aws_cloudwatch_log_group.ecs-log-group: Refreshing state... [id=/ecs/ecs-runner-task-def]
aws_secretsmanager_secret.AWS_SECRET_ACCESS_KEY: Refreshing state... [id=arn:aws:secretsmanager:ap-south-1:508656221602:secret:ecs-runner-AWS_SECRET_ACCESS_KEY-Oe3Bht]
aws_secretsmanager_secret.AWS_ACCESS_KEY_ID: Refreshing state... [id=arn:aws:secretsmanager:ap-south-1:508656221602:secret:ecs-runner-AWS_ACCESS_KEY_ID-Ce6nJu]
aws_iam_role.ecs_task_execution_role: Refreshing state... [id=ecs-runner_ecs_task_execution_role]
aws_secretsmanager_secret.ORG: Refreshing state... [id=arn:aws:secretsmanager:ap-south-1:508656221602:secret:ecs-runner-ORG-4ggH6u]
aws_vpc.vpc: Refreshing state... [id=vpc-07498bf92e0c86bd9]
aws_secretsmanager_secret.AWS_DEFAULT_REGION: Refreshing state... [id=arn:aws:secretsmanager:ap-south-1:508656221602:secret:ecs-runner-AWS_DEFAULT_REGION-Ege2jc]
aws_eip.nat_gateway_eip: Refreshing state... [id=eipalloc-0e7fc431ff5a103e9]
aws_iam_role_policy_attachment.ecs-task-execution-role-policy-attachment: Refreshing state... [id=ecs-runner_ecs_task_execution_role-20231113193744423200000001]
aws_secretsmanager_secret.PAT: Refreshing state... [id=arn:aws:secretsmanager:ap-south-1:508656221602:secret:ecs-runner-PAT-fgdVDt]
aws_iam_role_policy.password_policy_secretsmanager: Refreshing state... [id=ecs-runner_ecs_task_execution_role:password-policy-secretsmanager]
aws_iam_role_policy_attachment.admin-policy-attachment: Refreshing state... [id=ecs-runner_ecs_task_execution_role-20231113193744458800000002]
aws_secretsmanager_secret_version.AWS_DEFAULT_REGION_version: Refreshing state... [id=arn:aws:secretsmanager:ap-south-1:508656221602:secret:ecs-runner-AWS_DEFAULT_REGION-Ege2jc|82B59D96-9E50-4ABE-B34B-931684C50975]
aws_secretsmanager_secret_version.ORG_version: Refreshing state... [id=arn:aws:secretsmanager:ap-south-1:508656221602:secret:ecs-runner-ORG-4ggH6u|DEC188B0-3045-46AA-9874-230FA70FD577]
aws_secretsmanager_secret_version.AWS_ACCESS_KEY_ID_version: Refreshing state... [id=arn:aws:secretsmanager:ap-south-1:508656221602:secret:ecs-runner-AWS_ACCESS_KEY_ID-Ce6nJu|D5A15F32-590B-419B-99AD-66E52CF231CF]
aws_secretsmanager_secret_version.AWS_SECRET_ACCESS_KEY_version: Refreshing state... [id=arn:aws:secretsmanager:ap-south-1:508656221602:secret:ecs-runner-AWS_SECRET_ACCESS_KEY-Oe3Bht|CC47C722-B5F8-4ED6-A786-78EA714E3E83]
aws_secretsmanager_secret_version.REPO_version: Refreshing state... [id=arn:aws:secretsmanager:ap-south-1:508656221602:secret:ecs-runner-REPO-Oe3Bht|547BCED4-3D1A-4D18-8086-8B669105FF1A]
aws_secretsmanager_secret_version.PAT_version: Refreshing state... [id=arn:aws:secretsmanager:ap-south-1:508656221602:secret:ecs-runner-PAT-fgdVDt|BFAF2160-F282-4031-BFC2-2187407A61DD]
aws_ecs_task_definition.task_definition: Refreshing state... [id=ecs-runner-task-def]
aws_internet_gateway.int_gateway: Refreshing state... [id=igw-01c1b694a42658781]
aws_subnet.private_subnet: Refreshing state... [id=subnet-04f6bd53f3b41f090]
aws_subnet.public_subnet: Refreshing state... [id=subnet-0685110895bc6f5ee]
aws_security_group.ecs_sg: Refreshing state... [id=sg-03bd05b10393c96c8]
aws_route_table.route_table_public: Refreshing state... [id=rtb-063216b5f5f2501f8]
aws_nat_gateway.nat_gateway: Refreshing state... [id=nat-0080321254bfa3ed1]
aws_route_table_association.assoc_1: Refreshing state... [id=rtbassoc-0db31f2d7338db67b]
aws_ecs_service.ecs_service: Refreshing state... [id=arn:aws:ecs:ap-south-1:508656221602:service/ecs-runner-cluster/ecs-runner-ecs-service]
aws_route_table.route_table_private: Refreshing state... [id=rtb-00757056dc1d18288]
aws_appautoscaling_target.dev_to_target: Refreshing state... [id=service/ecs-runner-cluster/ecs-runner-ecs-service]
aws_route_table_association.assoc_2: Refreshing state... [id=rtbassoc-09bca5dc650e00b1b]
aws_appautoscaling_policy.dev_to_cpu: Refreshing state... [id=dev-to-cpu]
aws_appautoscaling_policy.dev_to_memory: Refreshing state... [id=dev-to-memory]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_appautoscaling_target.dev_to_target will be updated in-place
  ~ resource "aws_appautoscaling_target" "dev_to_target" {
        id                 = "service/ecs-runner-cluster/ecs-runner-ecs-service"
      ~ max_capacity       = 2 -> 3
      ~ min_capacity       = 1 -> 2
        tags               = {}
        # (6 unchanged attributes hidden)
    }

  # aws_ecs_service.ecs_service will be updated in-place
  ~ resource "aws_ecs_service" "ecs_service" {
        id                                 = "arn:aws:ecs:ap-south-1:508656221602:service/ecs-runner-cluster/ecs-runner-ecs-service"
        name                               = "ecs-runner-ecs-service"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:ap-south-1:508656221602:task-definition/ecs-runner-task-def:3" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.task_definition must be replaced
-/+ resource "aws_ecs_task_definition" "task_definition" {
      ~ arn                      = "arn:aws:ecs:ap-south-1:508656221602:task-definition/ecs-runner-task-def:3" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:ap-south-1:508656221602:task-definition/ecs-runner-task-def" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [ # forces replacement
              ~ {
                  - environment      = [] -> null
                  ~ logConfiguration = {
                      ~ options   = {
                          ~ awslogs-region        = "ap-northeast-1" -> "ap-south-1"
                            # (2 unchanged elements hidden)
                        }
                        # (1 unchanged element hidden)
                    }
                  - mountPoints      = [] -> null
                    name             = "ecs-runner"
                  ~ portMappings     = [
                      ~ {
                          - hostPort      = 80 -> null
                          - protocol      = "tcp" -> null
                            # (1 unchanged element hidden)
                        },
                    ]
                  - volumesFrom      = [] -> null
                    # (6 unchanged elements hidden)
                } # forces replacement,
            ]
        )
      ~ id                       = "ecs-runner-task-def" -> (known after apply)
      ~ revision                 = 3 -> (known after apply)
      - tags                     = {} -> null
      ~ tags_all                 = {} -> (known after apply)
        # (8 unchanged attributes hidden)
    }

  # aws_route_table.route_table_private will be updated in-place
  ~ resource "aws_route_table" "route_table_private" {
        id               = "rtb-00757056dc1d18288"
      ~ route            = [
          - {
              - carrier_gateway_id         = ""
              - cidr_block                 = "0.0.0.0/0"
              - core_network_arn           = ""
              - destination_prefix_list_id = ""
              - egress_only_gateway_id     = ""
              - gateway_id                 = ""
              - ipv6_cidr_block            = ""
              - local_gateway_id           = ""
              - nat_gateway_id             = "nat-0080321254bfa3ed1"
              - network_interface_id       = ""
              - transit_gateway_id         = ""
              - vpc_endpoint_id            = ""
              - vpc_peering_connection_id  = ""
            },
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + core_network_arn           = ""
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = "nat-0080321254bfa3ed1"
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = ""
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
        tags             = {
            "Name" = "ecs-runner_private"
        }
        # (5 unchanged attributes hidden)
    }

Plan: 1 to add, 3 to change, 1 to destroy.

Warning: Argument is deprecated

  with aws_eip.nat_gateway_eip,
  on infrastructure.tf line 52, in resource "aws_eip" "nat_gateway_eip":
  52:   vpc = true

use domain attribute instead

(and one more similar warning elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @pkj1993, Action: `pull_request`*